In [1]:
import pandas as pd
import numpy as np

In [2]:
data = {
    'name': ["hari","akhil","kumar" , 'krishna'],
    'age': [10,20,30,0],
    "year":[np.nan,1999,1998,1997]       # np.nan = not an number
}    
data

{'name': ['hari', 'akhil', 'kumar', 'krishna'],
 'age': [10, 20, 30, 0],
 'year': [nan, 1999, 1998, 1997]}

In [3]:
df1 =pd.DataFrame(data)
df1

      name  age    year
0     hari   10     NaN
1    akhil   20  1999.0
2    kumar   30  1998.0
3  krishna    0  1997.0

In [4]:
df1['year'].sum()

5994.0

In [5]:
df1['age'].min()

0

In [22]:
df1['age'].max()

30

In [23]:
df1['age'].var()

166.66666666666666

In [24]:
df1['name'].count()

4

In [8]:
df1['year'].mean()

1998.0

In [9]:
df1['age'].var()      # var = variation

166.66666666666666

In [10]:
df1['age'].std()

12.909944487358056